<?php

/* @var $this yii\web\View */

$this->title = 'Skillmeup - твоя мотивация';
?>

<div class="site-index">
    <div>Тут будет описание проекта</div>
    <div>Skillmeup - это мотивационный сервис для поэтапного достижения каких-либо личных целей с задачами и вознаграждениями.<br /><br /></div>
    <div>
        Что уже есть:<br />
        1. Можно создать мотивационный проект<br />
        2. Можно вступить в мотивационный проект (свой или чужой по ссылке)<br />
        3. Можно ставить задачи, назначать за них очки опыта<br />
        4. Участник проекта может выполнять задачи, владелец проекта принимает или отказывает, начисляется опыт участнику.<br />
        5. Можно ставить награды за опыт(или монеты), участник можно взять награду при достижении соответсвующих требований<br />
        
        <br />
        Что я точно буду реализовывать:<br />
        1. Авторизация через соц сети<br />
        2. Список пользователей и приглашение в проекты<br />
        3. Управление доступами в проекте<br />
        4. Оповещения на почту<br />
        5. Многочисленные настройки проекта (переименование названий, типы наград...)<br />
        6. и многое другое, что логично для соц. сетей<br />
        
        <br />
        Что вряд ли будет на первых этапах разработки:<br />
        1. Мобильное приложение<br />
    </div>
    <div style="margin-top: 20px;">По всем вопросам просьба писать на <a href="cool-di@mail.ru">cool-di@mail.ru</a></div>
</div>
